      * DATE 
      * YYYYMMDD format
        01 (PREFIX)-DATE.
         03 (PREFIX)-YEAR              PIC 9(4).
         03 (PREFIX)-MONTH             PIC 9(2). 
         03 (PREFIX)-DAY               PIC 9(2).
